// 节气
export const solar_terms_dict = new Array(
  "冬至",
  "小寒",
  "大寒",
  "立春",
  "雨水",
  "惊蛰",
  "春分",
  "清明",
  "谷雨",
  "立夏",
  "小满",
  "芒种",
  "夏至",
  "小暑",
  "大暑",
  "立秋",
  "处暑",
  "白露",
  "秋分",
  "寒露",
  "霜降",
  "立冬",
  "小雪",
  "大雪"
);

// 天干
export const gan_dict = new Array(
  "甲",
  "乙",
  "丙",
  "丁",
  "戊",
  "己",
  "庚",
  "辛",
  "壬",
  "癸"
);

// 地支
export const zhi_dict = new Array(
  "子",
  "丑",
  "寅",
  "卯",
  "辰",
  "巳",
  "午",
  "未",
  "申",
  "酉",
  "戌",
  "亥"
);

// 节气对应的月地支
export const month_zhi_dict = {
  立春: "寅",
  雨水: "寅",
  惊蛰: "卯",
  春分: "卯",
  清明: "辰",
  谷雨: "辰",
  立夏: "巳",
  小满: "巳",
  芒种: "午",
  夏至: "午",
  小暑: "未",
  大暑: "未",
  立秋: "申",
  处暑: "申",
  白露: "酉",
  秋分: "酉",
  寒露: "戌",
  霜降: "戌",
  立冬: "亥",
  小雪: "亥",
  大雪: "子",
  冬至: "子",
  小寒: "丑",
  大寒: "丑",
};

// 五虎遁
export const five_tigers_dict = {
  甲: "丙",
  己: "丙",
  乙: "戊",
  庚: "戊",
  丙: "庚",
  辛: "庚",
  丁: "壬",
  壬: "壬",
  戊: "甲",
  癸: "甲",
};

// 五鼠遁
export const five_mouses_dict = {
  甲: "甲",
  己: "甲",
  乙: "丙",
  庚: "丙",
  丙: "戊",
  辛: "戊",
  丁: "庚",
  壬: "庚",
  戊: "壬",
  癸: "壬",
};

// 天干对应的五行
export const gan_elements_dict = {
  甲: "木",
  乙: "木",
  丙: "火",
  丁: "火",
  戊: "土",
  己: "土",
  庚: "金",
  辛: "金",
  壬: "水",
  癸: "水",
};

// 地支对应的五行
export const zhi_elements_dict = {
  子: "水",
  丑: "土",
  寅: "木",
  卯: "木",
  辰: "土",
  巳: "火",
  午: "火",
  未: "土",
  申: "金",
  酉: "金",
  戌: "土",
  亥: "水",
};

// 地支藏干
export const zhi_hide_gan_dict = {
  子: ["癸"],
  丑: ["己", "癸", "辛"],
  寅: ["甲", "丙", "戊"],
  卯: ["乙"],
  辰: ["戊", "乙", "癸"],
  巳: ["丙", "戊", "庚"],
  午: ["丁", "己"],
  未: ["己", "丁", "乙"],
  申: ["庚", "壬", "戊"],
  酉: ["辛"],
  戌: ["戊", "辛", "丁"],
  亥: ["壬", "甲"],
};

// 地支藏干力量系数
export const zhi_hide_gan_quantization_dict = {
  子: [1],
  丑: [0.6, 0.3, 0.1],
  寅: [0.6, 0.3, 0.1],
  卯: [1],
  辰: [0.6, 0.3, 0.1],
  巳: [0.6, 0.3, 0.1],
  午: [0.7, 0.3],
  未: [0.6, 0.3, 0.1],
  申: [0.6, 0.3, 0.1],
  酉: [1],
  戌: [0.6, 0.3, 0.1],
  亥: [0.7, 0.3],
};

// 地支藏干基础分值
export const zhi_hide_gan_score_dict = {
  子: [100],
  丑: [60, 30, 10],
  寅: [60, 30, 10],
  卯: [100],
  辰: [60, 30, 10],
  巳: [60, 30, 10],
  午: [70, 30],
  未: [60, 30, 10],
  申: [60, 30, 10],
  酉: [100],
  戌: [60, 30, 10],
  亥: [70, 30],
};

// 十二长生
export const twelve_grow_dict = [
  "长生",
  "沐浴",
  "冠带",
  "临官",
  "帝旺",
  "衰",
  "病",
  "死",
  "墓",
  "绝",
  "胎",
  "养",
];

// 十二长生对应的旺相休囚
export const twelve_grow_state_dict = {
  长生: "相",
  沐浴: "相",
  冠带: "囚",
  临官: "旺",
  帝旺: "旺",
  衰: "囚",
  病: "休",
  死: "休",
  墓: "囚",
  绝: "死",
  胎: "死",
  养: "囚",
};

// 地支对应的季节
export const zhi_season_dict = {
  子: "冬",
  丑: "冬到春转换",
  寅: "春",
  卯: "春",
  辰: "春到夏转换",
  巳: "夏",
  午: "夏",
  未: "夏到秋转换",
  申: "秋",
  酉: "秋",
  戌: "秋到冬转换",
  亥: "冬",
};

// 季节对应的旺相休囚
export const season_state_dict = {
  春: "木旺 火相 水休 金囚 土死",
  夏: "火旺 土相 木休 水囚 金死",
  秋: "金旺 水相 土休 火囚 木死",
  冬: "水旺 木相 金休 土囚 火死",
  冬到春转换: "土旺 金相 火休 木囚 水死",
  春到夏转换: "土旺 金相 火休 木囚 水死",
  夏到秋转换: "土旺 金相 火休 木囚 水死",
  秋到冬转换: "土旺 金相 火休 木囚 水死",
};

// 旺相休囚力量系数
export const state_power_dict = {
  旺: 2,
  相: 1.414,
  休: 1,
  囚: 0.707,
  死: 0.5,
};

// 天干寒暖燥湿计分表
export const climate_gan_dict = {
  甲: 3,
  乙: 1,
  丙: 6,
  丁: 4,
  戊: 5,
  己: -4,
  庚: -1,
  辛: -3,
  壬: -5,
  癸: -6,
};

// 地支寒暖燥湿计分表
export const climate_zhi_dict = {
  子: -6,
  丑: -4,
  寅: 3,
  卯: 1,
  辰: -4,
  巳: 5,
  午: 6,
  未: 3,
  申: -2,
  酉: -3,
  戌: 4,
  亥: -5,
};

// 月令寒暖燥湿计分表
export const climate_month_dict = {
  子: -4,
  丑: -4,
  寅: 0,
  卯: 1,
  辰: 2,
  巳: 3,
  午: 4,
  未: -3,
  申: 0,
  酉: -1,
  戌: -2,
  亥: -3,
};

// 纳音
export const nayin_dict = {
  甲子: "海中金",
  乙丑: "海中金",
  丙寅: "炉中火",
  丁卯: "炉中火",
  戊辰: "大林木",
  己巳: "大林木",
  庚午: "路旁土",
  辛未: "路旁土",
  壬申: "剑锋金",
  癸酉: "剑锋金",
  甲戌: "山头火",
  乙亥: "山头火",
  丙子: "涧下水",
  丁丑: "涧下水",
  戊寅: "城头土",
  己卯: "城头土",
  庚辰: "白蜡金",
  辛巳: "白蜡金",
  壬午: "杨柳木",
  癸未: "杨柳木",
  甲申: "井泉水",
  乙酉: "井泉水",
  丙戌: "屋上土",
  丁亥: "屋上土",
  戊子: "霹雳火",
  己丑: "霹雳火",
  庚寅: "松柏木",
  辛卯: "松柏木",
  壬辰: "长流水",
  癸巳: "长流水",
  甲午: "沙中金",
  乙未: "沙中金",
  丙申: "山下火",
  丁酉: "山下火",
  戊戌: "平地木",
  己亥: "平地木",
  庚子: "壁上土",
  辛丑: "壁上土",
  壬寅: "金箔金",
  癸卯: "金箔金",
  甲辰: "覆灯火",
  乙巳: "覆灯火",
  丙午: "天河水",
  丁未: "天河水",
  戊申: "大驿土",
  己酉: "大驿土",
  庚戌: "钗钏金",
  辛亥: "钗钏金",
  壬子: "桑柘木",
  癸丑: "桑柘木",
  甲寅: "大溪水",
  乙卯: "大溪水",
  丙辰: "沙中土",
  丁巳: "沙中土",
  戊午: "天上火",
  己未: "天上火",
  庚申: "石榴木",
  辛酉: "石榴木",
  壬戌: "大海水",
  癸亥: "大海水",
};

// 农历月份列表
export const lunar_months_dict = {
  正: 1,
  二: 2,
  三: 3,
  四: 4,
  五: 5,
  六: 6,
  七: 7,
  八: 8,
  九: 9,
  十: 10,
  冬: 11,
  腊: 12,
};

// 农历日期列表
export const lunar_days_dict = {
  初一: 1,
  初二: 2,
  初三: 3,
  初四: 4,
  初五: 5,
  初六: 6,
  初七: 7,
  初八: 8,
  初九: 9,
  初十: 10,
  十一: 11,
  十二: 12,
  十三: 13,
  十四: 14,
  十五: 15,
  十六: 16,
  十七: 17,
  十八: 18,
  十九: 19,
  二十: 20,
  廿一: 21,
  廿二: 22,
  廿三: 23,
  廿四: 24,
  廿五: 25,
  廿六: 26,
  廿七: 27,
  廿八: 28,
  廿九: 29,
  三十: 30,
};

// 节气对应的公历月份
export const solar_terms_months_dict = {
  立春: 2,
  雨水: 2,
  惊蛰: 3,
  春分: 3,
  清明: 4,
  谷雨: 4,
  立夏: 5,
  小满: 5,
  芒种: 6,
  夏至: 6,
  小暑: 7,
  大暑: 7,
  立秋: 8,
  处暑: 8,
  白露: 9,
  秋分: 9,
  寒露: 10,
  霜降: 10,
  立冬: 11,
  小雪: 11,
  大雪: 12,
  冬至: 12,
  小寒: 1,
  大寒: 1,
};

// 固定序号排列
export const gan_index_dict = {
  0: "年干",
  1: "月干",
  2: "日干",
  3: "时干",
  4: "运干",
  5: "流年干",
  6: "流月干",
  7: "流日干",
};

// 固定序号排列
export const zhi_index_dict = {
  0: "年支",
  1: "月支",
  2: "日支",
  3: "时支",
  4: "运支",
  5: "流年支",
  6: "流月支",
  7: "流日支",
};

// 六柱标识
export const column_mark_dict = {
  流日: "fleetingDay",
  流月: "fleetingMonth",
  流年: "fleetingYear",
  运: "lucky",
  年: "year",
  月: "month",
  日: "day",
  时: "hour",
};

// 天干相合
export const gan_adapt_dict = {
  甲: "己",
  乙: "庚",
  丙: "辛",
  丁: "壬",
  戊: "癸",
  己: "甲",
  庚: "乙",
  辛: "丙",
  壬: "丁",
  癸: "戊",
};

// 天干相冲
export const gan_conflict_dict = {
  甲: "庚",
  乙: "辛",
  丙: "壬",
  丁: "癸",
  庚: "甲",
  辛: "乙",
  壬: "丙",
  癸: "丁",
};

// 地支相合
export const zhi_adapt_dict = {
  子: "丑",
  丑: "子",
  寅: "亥",
  卯: "戌",
  辰: "酉",
  巳: "申",
  午: "未",
  未: "午",
  申: "巳",
  酉: "辰",
  戌: "卯",
  亥: "寅",
};

// 地支相冲
export const zhi_conflict_dict = {
  子: "午",
  午: "子",
  丑: "未",
  未: "丑",
  寅: "申",
  申: "寅",
  卯: "酉",
  酉: "卯",
  辰: "戌",
  戌: "辰",
  巳: "亥",
  亥: "巳",
};

// 地支半合
export const zhi_adapt_half_dict = {
  申: ["子", "辰"],
  子: ["申", "辰"],
  辰: ["申", "子"],
  亥: ["卯", "未"],
  卯: ["亥", "未"],
  未: ["亥", "卯"],
  寅: ["午", "戌"],
  午: ["寅", "戌"],
  戌: ["寅", "午"],
  巳: ["酉", "丑"],
  酉: ["巳", "丑"],
  丑: ["巳", "酉"],
};

// 地支相害
export const zhi_harm_dict = {
  子: "未",
  未: "子",
  丑: "午",
  午: "丑",
  寅: "巳",
  巳: "寅",
  卯: "辰",
  辰: "卯",
  申: "亥",
  亥: "申",
  酉: "戌",
  戌: "酉",
};

// 地支相刑
export const zhi_punishment_dict = {
  子: ["卯"],
  卯: ["子"],
  寅: ["巳", "申"],
  巳: ["寅", "申"],
  申: ["寅", "巳"],
  丑: ["未", "戌"],
  未: ["丑", "戌"],
  戌: ["丑", "未"],
  辰: ["辰"],
  午: ["午"],
  酉: ["酉"],
};

// 五行元素的相生关系
export const generating_relations_dict = {
  金: "水",
  水: "木",
  木: "火",
  火: "土",
  土: "金",
};

// 五行元素的相克关系
export const overcoming_relations_dict = {
  金: "木",
  木: "土",
  土: "水",
  水: "火",
  火: "金",
};

// 四柱位置序号
export const zhu_index = {
  year: 1,
  month: 2,
  day: 3,
  hour: 4,
  lucky: 2,
  fleetingYear: 3,
};
